Revit 2024 API
MacroEnvironment Enumeration
 The Macro environments.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum MacroEnvironment
Visual Basic
Public Enumeration MacroEnvironment
Visual C++
public enum class MacroEnvironment
Members
Member name | Description
DB |  The DB environment.
UI |  The UI environment.
See Also
Autodesk.Revit.DB.Macros Namespace